{
  "broadArea": {
    "name": "Biotechnology and Biomedical Engineering",
    "link": "https://www.vlab.co.in/broad-area-biotechnology-and-biomedical-engineering",
    "code": "BIO"
  },
  "lab": "Immunology and Microbiology Lab",
  "lab_display_name": "Immunology and Microbiology Lab",
  "phase": "3-ext",
  "collegeName": "IITG",
  "baseUrl": "im-iitg.vlabs.ac.in",
  "introduction": "Since the Covid19 Pandemic, the area of Microbiology and Immunology has got more prominence. It was an emerging area before the pandemic but since the pandemic this field got a boost. The area of Microbiology and Immunology helps us to study about Immune Cells which protect us against foreign particles which can enter our body and also about variety of pathogens. There two main types of Immune Cells-B cells and T cells which play an important role in killing pathogens, infected cells and also cancerous cells. Both B cells and T cells can be isolated using molecular techniques and can be visualized under microscope. Both cells have distinctive features. Among the techniques which can be used to Study B cells and T cells, Flow Cytometry is an important Tool which can be used to study these cells. It employs Fluorescence and Laser to study the cells. It helps us to identify and characterize these cells. Now B cells and T cells produce Antibodies which protect us. These Antibodies are basically proteins. In general Proteins can be identified and characterized by following techniques-Western Blotting,Immunoprecipitation and ELISA. Western Blotting uses Antibody which are specific to Proteins in order to Identify and characterize them, Immunoprecipitation also uses Antibody to purify Proteins, ELISA is a technique which uses a complex of Enzyme-Antibody-Antigen reaction to detect and quantify proteins.<br><br>Now, proteins are also present in Egg. But still the functions of many proteins in egg are not known much. For this combination of several techniques like SDS PAGE(used to separate proteins) and Mass Spectrometry(helps in determining molecular weight and also different amino acids present in protein). Now if we want to track any protein or even a pathogen we can use Green Fluorescent Protein(GFP). For this we do a process called Cloning, where we insert the GFP in a vector and through this we can track protein or any pathogen.<br><br>Sometimes for performing an experiment, we use several “model organisms” like Chicken, Mouse, Pig, etc. Now for doing any experiment, the chick in the egg has to be killed. Normally chick takes 21 days to fully hatch from the egg, but between 9th and before 21st Day, the experiment has to be done on the egg. During this period, the growing chick might die if we are using Virus for our experiment. Now during growth of any human being, animals, there are numerous factors which can affect it, like pollution, pathogens, Oxygen, Temperature, Light, pH, etc. Temperature plays an important role in the growth of chick also. And if any foreign particle or pathogen comes, it can impact the growth of chick. So we can use drugs to kill them. The least amount of concentration required for killing or inhibiting the growth of pathogens/micro organisms is called Minimum Inhibitory Concentration(MIC). To kill or to inhibit the growth of pathogens,several Antimicrobial drugs are used.<br><br>So overall, the area of Microbiology and Immunology holds immense potential and several discoveries are yet to be made.",
 "experiments":[
  {
    "name": "Isolation and Microscopic Visualization of T cells and B cell",
    "short-name": "isolation-visualization-t-b-cells",
    "repo": "https://github.com/virtual-labs/exp-isolation-visualization-of-t-and-b-cells-iitg",
    "tag": "v1.0.0",
    "deploy": true
  },
  {
    "name": "Flow cytometry of the immune cells",
    "short-name": "flow-cytometry-immune-cells",
    "repo": "https://github.com/virtual-labs/exp-flow-cytometry-immune-cells-iitg",
    "tag": "v1.0.0",
    "deploy": true
  },
  {
    "name": "Western blot analysis of the cell lysate using antibody",
    "short-name": "western-blot-cell-lysate-antibody",
    "repo": "https://github.com/virtual-labs/exp-western-blot-cell-lysate-antibody-iitg",
    "tag": "v1.0.0",
    "deploy": true
  },
  {
    "name": "2D gel electrophoresis of the egg proteins",
    "short-name": "2d-gel-electrophoresis-egg-proteins",
    "repo": "https://github.com/virtual-labs/exp-2d-gel-electrophoresis-egg-proteins-iitg",
    "tag": "v1.0.0",
    "deploy": true
  },
  {
    "name": "Immunoprecipitation of protein from cell lysate using antibody",
    "short-name": "immunoprecipitation-protein-cell-lysate",
    "repo": "https://github.com/virtual-labs/exp-immunoprecipitation-antibody-cell-lysate-iitg",
    "tag": "v1.0.0",
    "deploy": true
  },
  {
    "name": "Enzyme-linked immunosorbent assay (ELISA) using protein and antibody",
    "short-name": "elisa-protein-antibody",
    "repo": "https://github.com/virtual-labs/exp-elisa-protein-antibody-iitg",
    "tag": "v1.0.0",
    "deploy": true
  },
  {
    "name": "Study of different stages of Chick Embryo",
    "short-name": "stages-chick-embryo",
    "repo": "https://github.com/virtual-labs/exp-chick-embryo-development-stages-iitg",
    "tag": "v1.0.0",
    "deploy": true
  },
  {
    "name": "Effect of physical and chemical environment on growth",
    "short-name": "effect-environment-growth",
    "repo": "https://github.com/virtual-labs/exp-physical-chemical-effect-on-growth-iitg",
    "tag": "v1.0.0",
    "deploy": true
  },
  {
    "name": "Determination of minimal inhibitory concentration (MIC) of an antibiotic",
    "short-name": "mic-antibiotic",
    "repo": "https://github.com/virtual-labs/exp-mic-of-antibiotic-iitg",
    "tag": "v1.0.0",
    "deploy": true
  },
  {
    "name": "Cloning and expression of GFP sequence/gene in the expression vector",
    "short-name": "cloning-expression-gfp-sequence",
    "repo": "https://github.com/virtual-labs/exp-gfp-cloning-expression-iitg",
    "tag": "v1.0.0",
    "deploy": true
  }
],
  "targetAudience": {
    "UG": [
      "B. Tech./ B.E in Bioscience and Bioengineering"
    ],
    "PG": [
      "MS/Ph. D. Beginners in Bioscience and Bioengineering and related topics"
    ]
  },
  "objective": "Progression of this lab is to provide exposure to the students and other users on the fundamental of Immunology and Microbiology . Educate the undergraduate students for the basics of immunological methods & the basics of microbiological methods and Provide a basic understanding of gene cloning and expression of its protein. The lab contents are chosen such that it covers the syllabi of the Immunology and Microbiology course of various universities to considerable extent. By performing such virtual laboratories remotely, the user can repeat the experiments for better understanding and also learn at their own pace and according to their time of convenience. The learning management system developed for the experiments try to provide a comprehensive coverage of different experiments covered under the laboratory.",
  "courseAlignment": {
    "description": "The lab contents are chosen such that it covers the syllabi of the Immunology and Microbiology course of various universities to considerable extent.",
    "universities": [
      "Universities with Bioscience and Bioengineering"
    ]
  }
 
}
