{
  "broadArea": {
    "name": "Biotechnology and Biomedical Engineering",
    "link": "https://www.vlab.co.in/broad-area-biotechnology-and-biomedical-engineering",
    "code": "BIO"
  },
  "lab": "Immunology and Microbiology Lab",
  "lab_display_name": "Immunology and Microbiology Lab",
  "phase": "3-ext",
  "collegeName": "IITG",
  "baseUrl": "im-iitg.vlabs.ac.in",
  "introduction": "Since the COVID-19 pandemic, microbiology and immunology have become more prominent. It was an emerging area before the pandemic, but this field has been boosted since the pandemic. The area of microbiology and immunology helps us study immune cells, which protect us against foreign particles that enter our body and various pathogens. There are two main types of immune cells- B and T cells- which play an important role in killing pathogens, infected cells, and cancerous cells. Both B and T cells can be isolated using molecular techniques and visualized under the microscope. Both cells have distinctive features. Among the methods that can be used to study B and T cells, flow cytometry is an important one. It employs fluorescence and laser to identify and characterize the B and T cells. The B cell produces antibodies, which are proteins.<br><br> In general, proteins can be identified and characterized by techniques like western blotting, immunoprecipitation, and ELISA. Western blotting uses antibodies that are specific to proteins to Identify and characterize them. The immunoprecipitation also uses antibodies to purify a particular protein. The ELISA technique uses a complex of enzyme-antibody-antigen reactions to detect and quantify proteins.<br><br> Proteins are also present in egg. However, the functions of many of those are not known. A combination of several techniques, such as SDS PAGE (used to separate proteins) and mass spectrometry (which helps determine molecular weight and different amino acids present in protein), is used to study those unknown proteins. Sometimes a green fluorescent protein (GFP) is used to track a protein or even a pathogen. For this, we do a process called cloning, where we insert the GFP-expressing gene in a vector, and through this, we can track protein or any pathogen.<br><br> Sometimes, when performing an experiment, we use several “model organisms” like chicken, mouse, rat, Guinae pig, etc. Usually, chick takes 21 days to hatch from the egg fully, but between 9th and 21st day, the experiment can be done on the egg. The growing chick might die during this period if we are a virus for our experiment. During the growth of any human being, or animals, numerous factors can affect it, like pollution, pathogens, oxygen, temperature, light, pH, etc. Temperature also plays a vital role in the growth of chicks.<br><br> Drugs or pharmacologically active compounds generally control the microorganisms. The least amount of concentration required for killing or inhibiting the growth of pathogens/microorganisms is called Minimum Inhibitory Concentration(MIC). Several antimicrobial drugs are used to kill or inhibit the growth of pathogens.<br><br>So, overall, microbiology and immunology hold immense potential, and several discoveries have yet to be made.",
 "experiments":[
  {
    "name": "Isolation and Microscopic Visualization of T cells and B cell",
    "short-name": "isolation-visualization-t-b-cells",
    "repo": "https://github.com/virtual-labs/exp-isolation-visualization-of-t-and-b-cells-iitg",
    "tag": "v1.0.0",
    "deploy": true
  },
  {
    "name": "Flow cytometry of the immune cells",
    "short-name": "flow-cytometry-immune-cells",
    "repo": "https://github.com/virtual-labs/exp-flow-cytometry-immune-cells-iitg",
    "tag": "v1.0.0",
    "deploy": true
  },
  {
    "name": "Western blot analysis of the cell lysate using antibody",
    "short-name": "western-blot-cell-lysate-antibody",
    "repo": "https://github.com/virtual-labs/exp-western-blot-cell-lysate-antibody-iitg",
    "tag": "v1.0.0",
    "deploy": true
  },
  {
    "name": "2D gel electrophoresis of the egg proteins",
    "short-name": "2d-gel-electrophoresis-egg-proteins",
    "repo": "https://github.com/virtual-labs/exp-2d-gel-electrophoresis-egg-proteins-iitg",
    "tag": "v1.0.0",
    "deploy": true
  },
  {
    "name": "Immunoprecipitation of protein from cell lysate using antibody",
    "short-name": "immunoprecipitation-protein-cell-lysate",
    "repo": "https://github.com/virtual-labs/exp-immunoprecipitation-antibody-cell-lysate-iitg",
    "tag": "v1.0.0",
    "deploy": true
  },
  {
    "name": "Enzyme-linked immunosorbent assay (ELISA) using protein and antibody",
    "short-name": "elisa-protein-antibody",
    "repo": "https://github.com/virtual-labs/exp-elisa-protein-antibody-iitg",
    "tag": "v1.0.0",
    "deploy": true
  },
  {
    "name": "Study of different stages of Chick Embryo",
    "short-name": "stages-chick-embryo",
    "repo": "https://github.com/virtual-labs/exp-chick-embryo-development-stages-iitg",
    "tag": "v1.0.0",
    "deploy": true
  },
  {
    "name": "Effect of physical and chemical environment on growth",
    "short-name": "effect-environment-growth",
    "repo": "https://github.com/virtual-labs/exp-physical-chemical-effect-on-growth-iitg",
    "tag": "v1.0.0",
    "deploy": true
  },
  {
    "name": "Determination of minimal inhibitory concentration (MIC) of an antibiotic",
    "short-name": "mic-antibiotic",
    "repo": "https://github.com/virtual-labs/exp-mic-of-antibiotic-iitg",
    "tag": "v1.0.0",
    "deploy": true
  },
  {
    "name": "Cloning and expression of GFP sequence/gene in the expression vector",
    "short-name": "cloning-expression-gfp-sequence",
    "repo": "https://github.com/virtual-labs/exp-gfp-cloning-expression-iitg",
    "tag": "v1.0.0",
    "deploy": true
  }
],
  "targetAudience": {
    "UG": [
      "B. Tech./ B.E in Bioscience and Bioengineering"
    ],
    "PG": [
      "MS/Ph. D. Beginners in Bioscience and Bioengineering and related topics"
    ]
  },
  "objective": "The purpose of this lab is to provide students and other users with exposure to the fundamentals of immunology and microbiology. Educate undergraduate students on the basics of immunological and microbiological methods and provide a basic understanding of gene cloning and its protein expression. The lab contents are chosen to cover the syllabi of various universities' immunology and microbiology courses to a considerable extent. By performing such virtual laboratories remotely, the user can repeat the experiments for better understanding and learn at their own pace and according to their convenience. The learning management system developed for the experiments tries to provide a comprehensive coverage of different experiments in the laboratory.",
  "courseAlignment": {
    "description": "The lab contents are chosen such that it covers the syllabi of the Immunology and Microbiology course of various universities to considerable extent.",
    "universities": [
      "Universities with Bioscience and Bioengineering"
    ]
  }
 
}
